
## Terraform plan for environment: `dev`

**Commit:** cfaa53426ed36c8d48c4aa87b89e4f6c9fdf3f78


**API version:** 988f85a
**Selfserve version:** 988f85a
**Internal version:** 988f85a

### Plan summary

`5 to add, 0 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.module.batch.aws_batch_compute_environment.this["a_fargate"]
module.service.module.batch.aws_batch_compute_environment.this["b_fargate_spot"]
module.service.module.batch.aws_batch_job_definition.this["job_configuration"]
module.service.module.batch.aws_batch_job_queue.this["high_priority"]
module.service.module.batch.aws_batch_job_queue.this["low_priority"]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.service.module.batch.aws_batch_compute_environment.this["a_fargate"] will be created
  + resource "aws_batch_compute_environment" "this" {
      + arn                             = (known after apply)
      + compute_environment_name        = (known after apply)
      + compute_environment_name_prefix = "batch-app-fargate-"
      + ecs_cluster_arn                 = (known after apply)
      + id                              = (known after apply)
      + service_role                    = "arn:aws:iam::054614622558:role/batch/dev-batch-app-batch-role-20240705091350939600000001"
      + state                           = "ENABLED"
      + status                          = (known after apply)
      + status_reason                   = (known after apply)
      + tags_all                        = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                            = "MANAGED"
    }

  # module.service.module.batch.aws_batch_compute_environment.this["b_fargate_spot"] will be created
  + resource "aws_batch_compute_environment" "this" {
      + arn                             = (known after apply)
      + compute_environment_name        = (known after apply)
      + compute_environment_name_prefix = "batch-app-fargate_spot-"
      + ecs_cluster_arn                 = (known after apply)
      + id                              = (known after apply)
      + service_role                    = "arn:aws:iam::054614622558:role/batch/dev-batch-app-batch-role-20240705091350939600000001"
      + state                           = "ENABLED"
      + status                          = (known after apply)
      + status_reason                   = (known after apply)
      + tags_all                        = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                            = "MANAGED"
    }

  # module.service.module.batch.aws_batch_job_definition.this["job_configuration"] will be created
  + resource "aws_batch_job_definition" "this" {
      + arn                        = (known after apply)
      + arn_prefix                 = (known after apply)
      + container_properties       = jsonencode(
            {
              + command                      = [
                  + "/var/www/html/vendor/bin/laminas --container=/var/www/html/config/container-cli.php",
                  + "queue:process-queue",
                ]
              + executionRoleArn             = "arn:aws:iam::054614622558:role/vol-app-dev-api-service-20240418150301367500000003"
              + fargatePlatformConfiguration = {
                  + platformVersion = "LATEST"
                }
              + image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:latest"
              + resourceRequirements         = [
                  + {
                      + type  = "VCPU"
                      + value = "1"
                    },
                  + {
                      + type  = "MEMORY"
                      + value = "2048"
                    },
                ]
            }
        )
      + deregister_on_new_revision = true
      + id                         = (known after apply)
      + name                       = "processQueue-job"
      + platform_capabilities      = [
          + "FARGATE",
        ]
      + propagate_tags             = true
      + revision                   = (known after apply)
      + tags                       = {
          + "JobDefinition" = "BatchTest"
        }
      + tags_all                   = {
          + "Environment"   = "dev"
          + "JobDefinition" = "BatchTest"
          + "Repository"    = "https://github.com/dvsa/vol-app"
        }
      + type                       = "container"

      + retry_strategy {
          + attempts = 3

          + evaluate_on_exit {
              + action       = "exit"
              + on_exit_code = "0"
            }
          + evaluate_on_exit {
              + action       = "retry"
              + on_exit_code = "1"
            }
        }

      + timeout {
          + attempt_duration_seconds = 60
        }
    }

  # module.service.module.batch.aws_batch_job_queue.this["high_priority"] will be created
  + resource "aws_batch_job_queue" "this" {
      + arn                   = (known after apply)
      + compute_environments  = [
          + (known after apply),
          + (known after apply),
        ]
      + id                    = (known after apply)
      + name                  = "BatchTestHighPriorityFargate"
      + priority              = 99
      + scheduling_policy_arn = "arn:aws:batch:eu-west-1:054614622558:scheduling-policy/BatchTestHighPriorityFargate"
      + state                 = "ENABLED"
      + tags                  = {
          + "JobQueue" = "High priority job queue"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "JobQueue"    = "High priority job queue"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.batch.aws_batch_job_queue.this["low_priority"] will be created
  + resource "aws_batch_job_queue" "this" {
      + arn                   = (known after apply)
      + compute_environments  = [
          + (known after apply),
          + (known after apply),
        ]
      + id                    = (known after apply)
      + name                  = "BatchTestLowPriorityFargate"
      + priority              = 1
      + scheduling_policy_arn = "arn:aws:batch:eu-west-1:054614622558:scheduling-policy/BatchTestLowPriorityFargate"
      + state                 = "ENABLED"
      + tags                  = {
          + "JobQueue" = "Low priority job queue"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "JobQueue"    = "Low priority job queue"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

```

</details>